namespace Danmu.Server.Constants;

public static class VupConstants
{
    public static readonly List<(string Uid, string Name, long RoomId)> Vups = new()
    {
        ("1104048496", "桃几OvO", 22642754),
        ("4718716", "鱼鸽鸽", 673),
        ("3493271057730096", "妮莉安Lily", 27484357),
        ("17967817", "大哥L-", 443197),
        ("15641218", "帅比笙歌超可爱OvO", 545),
        ("1376650682", "葡冷尔子gagako", 22857429),
        ("7591465", "里奈Rina", 873642),
        ("390647282", "浅野天琪_TANCHJIM", 21465419),
        ("188679", "Niya阿布", 685026),
        ("128667389", "-蔻蔻CC-", 23587427),
        ("703018634", "莱妮娅_Rynia", 54363),
        ("90873", "内德维德", 5424),
        ("1112031857", "薇Steria", 22924075),
        ("121309", "CODE-V", 858080),
        ("796556", "-菫時-", 3473884)
    };
}
